# St7SetTransientHeatFile

Assigns the temperature file to be used for quasi-static and nonlinear transient dynamic analysis.

long St7SetTransientHeatFile(long uID, char* FileName, double RefTemp)
Input Parameters
uID
Strand7 model file ID.
FileName
Full path and name for the temperature file.
RefTemp
Reference temperature.